/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ShrubberyCreationForm.cpp                          :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: lud-adam <lud-adam@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2026/02/05 09:43:50 by lud-adam          #+#    #+#             */
/*   Updated: 2026/02/05 18:10:07 by lud-adam         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "ShrubberyCreationForm.hpp"

#include <fstream>

ShrubberyCreationForm::ShrubberyCreationForm(void) : AForm("John", 145, 137, false)
{
	std::cout << this->getName() << " ShrubberyCreationForm Default constructor called" << std::endl;
}

ShrubberyCreationForm::~ShrubberyCreationForm(void)
{
	std::cout << this->getName() << " ShrubberyCreationForm Destructor called" << std::endl;
}

ShrubberyCreationForm::ShrubberyCreationForm(const ShrubberyCreationForm &other) : AForm(other)
{
	std::cout << this->getName() << " ShrubberyCreationForm Copy Constructor called" << std::endl;
}

ShrubberyCreationForm&	ShrubberyCreationForm::operator=(const ShrubberyCreationForm &other)
{
	if (this != &other)
		this->setAFormSigned(other.getAFormSigned());
	return (*this);
}

ShrubberyCreationForm::ShrubberyCreationForm(const std::string _name) : AForm(_name, 145, 137, false)
{
	std::cout << this->getName() << " ShrubberyCreationForm Parameterized Constructor called" << std::endl;
}

void ShrubberyCreationForm::execute(Bureaucrat const & executor)
{
	try 
	{
		this->checkRequirements(executor);
	}
	catch (AForm::FormNotSigned &e)
	{
		std::cout << "Error: Form not signed" << std::endl;
		return ;
	}
	std::ofstream	file;
	std::string	temp;

	temp = executor.getName() + "_shrubbery";
	std::cout << temp << std::endl;
	file.exceptions(std::ofstream::failbit | std::ofstream::badbit);
	try 
	{
		file.open(temp.c_str());
	}
	catch (std::ofstream::failure e)
	{
		std::cout << "Error in creating file!" << std::endl;
		return ;
	}
	file << "         ≈√                      π≈π     √  ∞                      π                ≈√           ∞           √      ≈π×            \n";
	file << "         =√π       π               ∞≈    √         √      ≈                   ∞√ π∞∞≈           ∞√        π∞      ÷≈∞        ÷     \n";
	file << "∞        √ππ       √  √             ∞√  ≠π       π≈       ∞      π        ∞              π     ∞          π     ππ√                \n";
	file << "≈∞       ≈π ≈                          ≈  π     π          π ≈    π ≠  √ √π              π    π                ∞                   \n";
	file << " ÷       ÷π ×        ≈                 ≈        ≈                √π  π π               ∞      √                         π×         \n";
	file << "  ≈π≈π    √ ππ       √                        √          π   π  ∞ π π∞π           π∞π       ∞√              ≈  √                   \n";
	file << "    =   √ ≈π≈≠     π ∞                         ∞                π   ∞         π  ≈ π∞     √ √            π  √                      \n";
	file << "       ÷π  ≠√ ≈    ÷ √≠    π          π       ∞           = ∞   π  ≈         π  ∞       ππ π             √≈                        \n";
	file << "          ≈∞ππ=×      π              ≈π       ≈          √  ∞   √ ≠             √ √≠∞≈π√∞      π      ∞ π≈                         \n";
	file << "             ≈  ≈   π π√√               ∞  ∞ππ√    √      ≠ ≠  π∞π       √  π   √ √  π       ∞ π     ≠ ∞                         √ \n";
	file << "                     ∞ √  ×√        ∞   ≈     ≠    ≈         ≈  √÷      π        πππ       √        ≠√                             \n";
	file << "√                  =   π≈   π≈         π÷   π∞π                 π÷      ≠π     π  √      ∞ π        π                         ≈    \n";
	file << "√        πππ    √π  ≈      ∞ π√      ππ -   ∞≠           √  √  √√-      ≠ ∞   √          √        π √    π∞π                √≈     \n";
	file << " ×          ≈÷√  ∞ππ π         π√   √  π∞  ≈√≈     ≈√    ≠∞    √√÷       π ≈ ∞π         π         π     ≠         ≈       ∞√       \n";
	file << " ∞=               π∞ π÷           ≈ ππ √√÷ ÷∞∞     ≈≈     ∞ π ∞ √    =   ππ √            π π     = ππ ∞          π     ≠π          \n";
	file << "  √√×                π          π  ≈ π  π√=≈≈≠      ≠   ≠π√ π ∞ ≈      ππ π∞    ÷√≈      ÷ ∞    ×≈π             ∞   ≠  ÷           \n";
	file << "≠    √÷               π  ≈     π ≈ π≈  π≠π÷∞≈≈      ≠∞∞√√  √  √       ≠π√√∞  π∞          ≠π∞  ×∞ ππ√×            ×  ≈              \n";
	file << "  π=     ×             ∞ √     ≠    π≈≠≈∞√≈=≈≈=     ≈√√≈π∞√  π√      ≈∞√√√≠÷             π π    √ ≈≈           ≈          ÷        \n";
	file << "      π     ∞=√        ≈π√∞    ≈  π π∞√√ √√=∞==     ∞∞≈≈π√π π∞√     -≈√∞√=≈             ≠∞    ∞=√            √      π π√≈√        =\n";
	file << "         √ π√ √∞=       π∞∞∞   √π ππ ∞π√√√≈≈≠∞÷     ≈≈∞∞π√ ∞π≈≈∞√   =√≈≈≈         √×≠∞ π  π                ≠  √ πππ≈        ∞√  π  \n";
	file << "                   ≠∞ ≈∞π π  ≈÷-≈∞√∞√√×∞√ ∞≈ π     π   ππ    π      π     ∞   ππ≠√∞≈π√ππ≈÷   ×√      ≈≠                 √  ≈       \n";
	file << "   √÷√√√√π≈∞≈≠≈ √πππ√√π√πππ√π √ √     π  π      π   ∞ √      √ππ√∞≈π∞≈∞π≠ π∞≈π≈ π π  π∞π ≠                           ≈  √          \n";
	file << "∞∞∞≈∞∞≠÷        ≠√√∞πππ π π√ √ √       ππ                 π  √π    ππ√π≈≠ √π√√π √√∞   ∞√√√π√≈π          π  π√√√∞∞   π≈             \n";
	file << "××-=             √≈∞π√π  π  π π                         π    π   π  π√π∞ππππ√π√∞≠        ≠≈≈∞∞∞≈≠≠≠≠≈π   ∞≠√                       \n";
	file << "                   - ππ        π      π √π                          π√≈≈ππ ∞√∞√+             ×÷=≈∞∞=-÷√                            \n";
	file << "                    ≈=ππ π        π    √                   π    π   π π√∞√√∞∞=÷                                ≈                   \n";
	file << "                      ÷ ∞               ∞                  π     π  π  √∞∞∞∞                                                       \n";
	file << "                       ÷  π π           π              π   π   π      ππ√≠≈                                                        \n";
	file << "                       ≠≈π                             ∞   π         π  π×=                                                        \n";
	file << "                        ÷ ∞               π             π          πππ √√=-                                                        \n";
	file << "                        ≠  √         √                  ππ  √        ππ∞ππ×                                                        \n";
	file << "                        ≠  √        π∞  π π  ∞∞      ≠   ≈≠         π  ≈≈π=≈                                                       \n";
	file << "                        =  √     π  ∞∞≠       ≠      ≈       ≠∞ π√π √π√√≈√≈÷                                                       \n";
	file << "                       ≠π∞∞√  π  √×≈ √       =π∞     ≈=         √≈≈  π√√√√≈÷                                                       \n";
	file << "                       π ≈ππ√ ≠×≠    ÷ ∞ π√π=√∞∞     ∞√÷π      √ √ ≠×∞√√√≈∞=                                                       \n";
	file << "                      ∞∞π√π√≠= ≈     ≠ ≈ ≠÷≠π  ≈      π ≠×≈≈  ≠√π√π ÷√≠≠√∞≈÷                                                       \n";
	file << "                      π√√∞π∞≠√π√   π≠√×≠≠≈∞πππ           π√π≈÷×≈π≈√√÷≈≠≈=∞==                                                       \n";
	file << "                       ÷∞π∞÷≈≠≈=∞≈≠=≠√∞∞√∞π  ππ       π      π√≈=÷≠∞÷≠≠≠÷≈÷=                                                       \n";
	file << "                       ×π∞≠==÷=≠∞∞≠√√√ππ√     ∞                πππ∞≠÷×÷≠≠=≠×                                                       \n";
	file << "                       =√π÷=≈√√∞∞≈≈≈∞∞∞π    ∞√               π√πππ ππ√≈×÷÷≠=+                                                      \n";
	file << "                       ≈√√π∞∞√ππππ  π                  =≈        π   π√≈∞≠≈≠×                                                      \n";
	file << "                      -∞π√ √√√ππ           ≈            ≠√           ππ≈∞∞≠≠=×                                                     \n";
	file << "                      ×∞√π √ππ              =πππ     ∞÷≠÷≠            π∞∞≈≈∞≈≠∞                                                    \n";
	file << "                     ÷≈√√π≈ππ              ==÷≠≈≈≠≈≈≈≈≠=≠π∞π          ∞√√∞≈≈÷∞×                                                    \n";
	file << "                    ÷∞=≈∞√≈π          π≠    π π≠≈√≈√√π÷π      ÷π      √√√≈∞≈≈≠≠+                                                   \n";
	file << "                   -=≈∞≈√∞√√π π√√∞π ≈          π≈π ∞√≠  √ π    √√≈ π≠∞√∞√≈≈∞≈≈≠×                                                   \n";
	file << "                   ≈≈≈∞√√∞√∞∞ππππ≠π     √       ∞√ √= √π           ≠∞ √π√∞∞∞√≠≈≠                                                   \n";
	file << "                  ≠≈≈≈π≈≠≠=÷÷≠∞π  ∞π    π√∞≠÷≈÷=≈∞≈=∞≈≠=≠∞√         ≠==≈∞∞∞∞≈∞≠≈                                                   \n";
	file << "                  ×∞≠∞≠√≈≈∞=∞∞√π ππ ∞ ∞≈∞÷≠              √÷÷≠π  √∞≠√∞≈∞√≠÷÷=≈=≈≈√                                                  \n";
	file << "                  ÷=≈∞ ==≈≈≈≈∞≈∞√∞√∞√∞≠-≠=≠∞√√π      πππ√≈=∞≈-√=≈√≠≠≈≈≈≈÷∞=≈×≈≈×-                                                  \n";
	file << "                 π≠∞∞π≈≈≈∞×≠≈≠≈∞≠=≠∞≠×≠ √≈∞≈=×=∞√√ ∞√∞≈÷≠≈π√ π ≠÷≠∞≈≠=≠≠==≠≈∞≠≈=÷                                                  \n";
	file << "               π÷÷√∞∞∞∞√√√  ≈=÷×--=√ππ  √∞π √==≈≠≠≠≈≠≠≈√≈π        ÷××÷×≈√∞∞≈≈≠≠≠=≠-                                                \n";
	file << "             ≈=≈∞∞∞√≈≈∞∞√π√√≈π√π π√√        π ∞√∞∞∞∞∞∞√√π         √  √π∞√π√√√∞≈≠≠≠=≠×∞                                             \n";
	file << "           ≈=≠≠≈≠≈√≈∞∞∞√√√√∞≠ √    ∞          π πππππππππ         √  ∞ππ∞π√∞≈≈≈∞≠≈≠=≠≠×π                                           \n";
	file << "         ÷=≈≠≠≈∞∞∞≈≈∞√∞√√∞∞≠πππππ  ∞            ππππ           √π √   ≈√ √√√√√≈∞≈≈∞≈≠≈≈=×                                          \n";
	file << "       ×≈=≈∞≈∞≈≈≈≈≈√√√√≈∞=√π∞∞π  √√√  π  π  π   ππππ  π        ∞  √   ∞∞ √ ∞ππ√∞≈≈≠∞≠≈∞≈≠÷π                                        \n";
	file << "     ====≈≈≈≠≠≈∞∞√√√√∞≈≠∞π∞√   πππ √≈ ππ √  π  √πππππ ππ π∞  √ ∞π π   √ π√ ≈   ≈√π∞√π≠≈√∞≈≠-                                       \n";
	file << "    =≈≈≈≈≠≠≈≈∞∞√√√π∞≈√π π≠  π   π  √√πππ√∞    π∞π√π√πππ√ππ≈ππππ√√∞  √≈   √√   √  ππππ =π∞ π√≠-                                     \n";
	file << "  ≠≠∞∞∞≠≈√∞∞∞∞∞√√√π≈=≠√≠π ≠≈  π √   ππππ√≈πππππ∞√√√√√√√√√≠√√ π∞√√  π∞π   ≠√√   ππ π√  π √√ππ    π√				    \n";
	file << " ×=∞∞≈√√∞∞∞√√∞∞π√√≈√≠=∞ππππ÷  ∞π  ∞ √ πππ≈∞ √π√≠∞∞√∞∞∞√≈√≈≠√∞π√≈∞ ππ √ √    ≈×   π   π√              ≠                             \n";
	file << "≠×∞√∞∞∞√√√√√√√∞√≈ππ√≠√√πππ        √π∞ π√π≠≠∞∞∞∞≈∞≈∞≠≠≈≈≠≈≠≠∞≈∞∞∞≠√√∞π√≈≠√π√  √π÷√ π√   π√π  √ππ       √≈                           \n";
	file << "√∞∞√√√√∞∞√√∞∞∞√ ∞≠≠=≈π π√π  ππ√  ≠ π≈π√√√≠≠∞∞∞∞≠≈≈∞=≠≈∞≠≈≠≠≈≈≈≈≠∞∞∞≈√∞∞π π  ∞√ √≈∞ π           π√  √   π                           \n";
	file << "∞≈≈√√∞≈≈≈∞√π√∞÷≈√√√≈√∞ √  π√√ π√∞  ∞√√√∞√≈=≈∞√≠≠≈≠≈÷=∞≠≈==≈≠≈∞≈≠√∞∞≈√≠π√∞π√√π≈√ √∞√√∞π ππ∞π∞ππ   π√                                \n";
	file << " ππππ√√∞≈==≠√ππ√π√∞=π π ∞≈∞   ≈ π√≈π√π∞≈√≈≠≈≠≠=÷÷=÷÷÷×=≠≠==÷≈≈≈=∞∞∞≈√∞≈√√π√∞∞π∞≈  =√√∞=≈∞∞√√ππ√ππ  π                               \n";
	file << "   ππ             ≠≈  ∞≠√  ∞∞π√πππππππ∞≠≈×=∞ππ√πππ√√√√∞∞√ππ≈=≠÷÷≈≈=≈≈∞∞≠π∞≈ ππ√≈∞√∞   ππ  π√π∞≈≈≈≠π                                \n";
	file << "                √≠√≈√≈√       =∞√√√≠=∞π        π   √πππ        ÷×√≈≠≈=≈∞π≠ √ ππ π≈π≈                                               \n";
	file << "               ÷√∞ π≈      ≠ ∞√π≈≠                               ÷≈≈∞≠≈π≈ππ√∞ √  √  ≈                                              \n";

	file << "                 &&& &&  & &&              \n";
	file << "            && &\\/&\\|& ()|/ @, &&          \n";
	file << "            &\\/(/&/&||/& /_/)_&/_&          \n";
	file << "         &() &\\/&|()|/&\\/ '%\" & ()           \n";
	file << "        &_\\_&&_\\ |& |&&/&__%_/_& &&          \n";
	file << "      &&   && & &| &| /& & % ()& /&&         \n";
	file << "       ()&_---()&\\&\\|&&-&&--%---()~           \n";
	file << "           &&     \\||/                         \n";
	file << "                   ||                          \n";
	file << "      .==========================.             \n";
	file << "      |      O            O       |             \n";
	file << "      |          ________          |             \n";
	file << "      |         /        \\         |             \n";
	file << "      |        |   ____   |        |             \n";
	file << "      |         \\________/         |             \n";
	file << "      '=========================='             \n";
	file << "                   ||                          \n";
	file << "                   ||                          \n";
	file << "                 ======                        \n";
	file.close();
	std::cout << "File created successfully." << std::endl;
}
